# Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.

a = None
if a == True:
    print('значение равно True')
elif a == False:
    print('значение равно False')
else:
    print('значение не определено')