# Вывести на экран числа от 0 до 50, кроме 35.
a = [i for i in range(1,50)]
a.remove(35)
print('Список чисел, кроме числа 35: ', a)