# Создать список с числами от 1 до 50 используя генератор списков.
a = [i for i in range(1,50)]
print('Список чисел от 1 до 50: ', a)