1.	Какой тип данных используется для хранения целых чисел в Python?
a. int
b. float
c. str
d. list

Ответ: a.

2.	Какой тип данных используется для хранения вещественных чисел в Python?
a. int
b. float
c. str
d. list

Ответ: b.

3.	Какой тип данных используется для хранения строк в Python?
a. int
b. float
c. str
d. list

Ответ: c.

4.	Какая операция используется для объединения двух строк в Python?
a. +
b. –
c. *
d. /

Ответ: a.

5.	Какой оператор используется для проверки равенства значений в Python?

a. =
b. ==
c.  !=
d. <>

Ответ: b.

6.	Какой оператор используется для проверки больше или меньше значения в Python?
a. = b.
b. ==
c. !=
d. <>

Ответ: d.

7.	Какой оператор используется для проверки, входит ли элемент в список в Python?
a. in
b. not in
c. both a and b
d. neither a nor b

Ответ: a.

8.	Какой оператор используется для проверки, является ли элемент частью строки в Python?
a. in
b. not in
c. both a and b
d. neither a nor b

Ответ: a.

9.	Какой оператор используется для создания условия в Python?
a. if
b. then
c. when
d. maybe

Ответ: a.

10.	Какой оператор используется для выхода из цикла в Python?
a. break
b. continue
c. exit
d. stop

Ответ: a.

11.	Какой оператор используется для продолжения выполнения цикла в Python?
a. break
b. continue
c. exit
d. stop

Ответ: b.

12.	Какой метод используется для получения элемента списка по индексу в Python?
a. get()
b. index()
c. item()
d. none of the above

Ответ: b.

13.	Какой метод используется для добавления элемента в конец списка в Python?
a. add()
b. insert()
c. append()
d. extend()

Ответ: c.

14.	Какой метод используется для удаления элемента из списка в Python?
a. delete()
b. remove()
c. pop()
d. erase()

Ответ: b.

15.	Какая функция используется для получения длины списка в Python?
a. length()
b. size()
c. count()
d. len()

Ответ: d.

16.	 Что будет результатом программы и почему?
x = 4.5
y = 2
print(x // y)

Ответ: 2.0 ("//" - деление без остатка, показывает только целую часть)

17.	 Какая будет итоговая длина списка и почему?
a = [1 ,2 ,3, None, (), [] , ]
print(len(a))

Ответ: 6. len показывает длинну списка. В списке 6 элементов.

18.	Какой будет результат программы?
x = True
y = False
z = False
if not x or y:
    print(1)
elif not x or not y and z:
    print(2)
elif not x or y or not y and x:
    print(3)
else:
    print(4)

Ответ: 3. Только в этом варианте условие истина (true)

19.	Что выведет следующий код, при его исполнении?
print(type(1 / 2))

Ответ: class float. 1/2= 0.5 это не целое цисло, т.е. float

20.	Какие из приведенных ниже имен переменных не корректны?
a. my-var   b. my_var  c. Myvar   d. _myvar

Ответ: a
